# SolidCurveIntersectionOptions Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
SolidCurveIntersectionOptions Properties
SolidCurveIntersectionOptions Class See Also
---
The SolidCurveIntersectionOptions type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| ResultType | The type of results expected by the calculation. The default is CurveSegmentsInside. |

# See Also
SolidCurveIntersectionOptions Class
Autodesk.Revit.DB Namespace